/***************
TH和TL的值仅限使用在12MHz的晶振
***************/

#include<reg52.h>
#include<stdio.h>
void delay_50ms();
sbit led = P2^0;

void main()
{
	TMOD = 0x10;//设置定时器T1为方式1
	
	TR1 = 1;//启动定时器T1
	P2 = 0xff;//对八个LED灯珠进行初始化
	while(1)
	{
		P2 = ~P2;
		delay_50ms();
		
		
	}
}
void delay_50ms()
{
	unsigned int i;
	for(i = 0;i < 20 ; i++)
	{
		TH1 = (65536 - 50000) / 256;//定时50ms
		TL1 = (65536 - 50000) % 256;
		while(TF1!=1);//等待溢出
		TF1 = 0;//手动置0
	}
}

/*******************

TF1
↓
1 == 1等于1循环*********0 == 1等于0不循环
1 == 0等于0不循环*******0 == 0等于1循环
1 != 1等于0不循环********0 != 1等于1循环
1 != 0等于1循环**********0 != 0等于0不循环


*********************/